RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_can.h
/**
  *******************************************************************************************************
  * @file    fm33lg0xx_fl_can.h
  * @author  FMSH Application Team
  * @brief   Head file of CAN FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2021] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under Mulan PSL v2.
  * You can use this software according to the terms and conditions of the Mulan PSL v2.
  * You may obtain a copy of Mulan PSL v2 at:
  *          http://license.coscl.org.cn/MulanPSL2
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND,
  * EITHER EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT,
  * MERCHANTABILITY OR FIT FOR A PARTICULAR PURPOSE.
  * See the Mulan PSL v2 for more details.
  *
  *******************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LG0XX_FL_CAN_H
#define __FM33LG0XX_FL_CAN_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lg0xx_fl_def.h"
/** @addtogroup FM33LG0XX_FL_Driver
  * @{
  */

/** @defgroup CAN CAN
  * @brief CAN FL driver
  * @{
  */

/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_ES_INIT CAN Exported Init structures
  * @{
  */

/**
  * @brief FL CAN Init Sturcture definition
  */
typedef struct
{
    /*工作模式*/
    uint8_t mode;
    /*同步段长度*/
    uint8_t SJW;
    /*时间段1*/
    uint8_t TS1;
    /*时间段2*/
    uint8_t TS2;
    /*波特率预分频*/
    uint8_t BRP;
    /*时钟源选择*/
    uint8_t clockSource;

} FL_CAN_InitTypeDef;

/**
  * @brief  CAN filter init structure definition
  */
typedef struct
{

    /*滤波器SRR位*/
    uint32_t filterIdSRR;
    /*滤波器IDE位*/
    uint32_t filterIdIDE;
    /*滤波器RTR位*/
    uint32_t filterIdRTR;
    /*滤波器使能*/
    uint32_t  filterEn;
    /*滤波器标准ID*/
    uint32_t filterIdStandard;
    /*滤波器扩展ID*/
    uint32_t filterIdExtend;
    /*滤波器ID高11位掩码*/
    uint32_t filterMaskIdHigh;
    /*滤波器SRR位掩码*/
    uint32_t filterMaskIdSRR;
    /*滤波器IDE位掩码*/
    uint32_t filterMaskIdIDE;
    /*滤波器ID低18位掩码*/
    uint32_t filterMaskIdLow;
    /*滤波器RTR位掩码*/
    uint32_t filterMaskIdRTR;

} FL_CAN_FilterInitTypeDef;


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_Exported_Constants CAN Exported Constants
  * @{
  */

#define    CAN_CR_CEN_Pos                                         (1U)
#define    CAN_CR_CEN_Msk                                         (0x1U << CAN_CR_CEN_Pos)
#define    CAN_CR_CEN                                             CAN_CR_CEN_Msk

#define    CAN_CR_SRST_Pos                                        (0U)
#define    CAN_CR_SRST_Msk                                        (0x1U << CAN_CR_SRST_Pos)
#define    CAN_CR_SRST                                            CAN_CR_SRST_Msk

#define    CAN_MSR_LPBACK_Pos                                     (1U)
#define    CAN_MSR_LPBACK_Msk                                     (0x1U << CAN_MSR_LPBACK_Pos)
#define    CAN_MSR_LPBACK                                         CAN_MSR_LPBACK_Msk

#define    CAN_BRPR_BRP_Pos                                       (0U)
#define    CAN_BRPR_BRP_Msk                                       (0xffU << CAN_BRPR_BRP_Pos)
#define    CAN_BRPR_BRP                                           CAN_BRPR_BRP_Msk

#define    CAN_BTR_SJW_Pos                                        (7U)
#define    CAN_BTR_SJW_Msk                                        (0x3U << CAN_BTR_SJW_Pos)
#define    CAN_BTR_SJW                                            CAN_BTR_SJW_Msk

#define    CAN_BTR_TS2_Pos                                        (4U)
#define    CAN_BTR_TS2_Msk                                        (0x7U << CAN_BTR_TS2_Pos)
#define    CAN_BTR_TS2                                            CAN_BTR_TS2_Msk

#define    CAN_BTR_TS1_Pos                                        (0U)
#define    CAN_BTR_TS1_Msk                                        (0xfU << CAN_BTR_TS1_Pos)
#define    CAN_BTR_TS1                                            CAN_BTR_TS1_Msk

#define    CAN_ECR_REC_Pos                                        (8U)
#define    CAN_ECR_REC_Msk                                        (0xffU << CAN_ECR_REC_Pos)
#define    CAN_ECR_REC                                            CAN_ECR_REC_Msk

#define    CAN_ECR_TEC_Pos                                        (0U)
#define    CAN_ECR_TEC_Msk                                        (0xffU << CAN_ECR_TEC_Pos)
#define    CAN_ECR_TEC                                            CAN_ECR_TEC_Msk

#define    CAN_ESR_ACKER_Pos                                      (4U)
#define    CAN_ESR_ACKER_Msk                                      (0x1U << CAN_ESR_ACKER_Pos)
#define    CAN_ESR_ACKER                                          CAN_ESR_ACKER_Msk

#define    CAN_ESR_BERR_Pos                                       (3U)
#define    CAN_ESR_BERR_Msk                                       (0x1U << CAN_ESR_BERR_Pos)
#define    CAN_ESR_BERR                                           CAN_ESR_BERR_Msk

#define    CAN_ESR_STER_Pos                                       (2U)
#define    CAN_ESR_STER_Msk                                       (0x1U << CAN_ESR_STER_Pos)
#define    CAN_ESR_STER                                           CAN_ESR_STER_Msk

#define    CAN_ESR_FMER_Pos                                       (1U)
#define    CAN_ESR_FMER_Msk                                       (0x1U << CAN_ESR_FMER_Pos)
#define    CAN_ESR_FMER                                           CAN_ESR_FMER_Msk

#define    CAN_ESR_CRCER_Pos                                      (0U)
#define    CAN_ESR_CRCER_Msk                                      (0x1U << CAN_ESR_CRCER_Pos)
#define    CAN_ESR_CRCER                                          CAN_ESR_CRCER_Msk

#define    CAN_SR_ACFBSY_Pos                                      (11U)
#define    CAN_SR_ACFBSY_Msk                                      (0x1U << CAN_SR_ACFBSY_Pos)
#define    CAN_SR_ACFBSY                                          CAN_SR_ACFBSY_Msk

#define    CAN_SR_TXFLL_Pos                                       (10U)
#define    CAN_SR_TXFLL_Msk                                       (0x1U << CAN_SR_TXFLL_Pos)
#define    CAN_SR_TXFLL                                           CAN_SR_TXFLL_Msk

#define    CAN_SR_TXBFLL_Pos                                      (9U)
#define    CAN_SR_TXBFLL_Msk                                      (0x1U << CAN_SR_TXBFLL_Pos)
#define    CAN_SR_TXBFLL                                          CAN_SR_TXBFLL_Msk

