RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_can.h
#define    CAN_SR_ESTAT_Pos                                       (7U)
#define    CAN_SR_ESTAT_Msk                                       (0x3U << CAN_SR_ESTAT_Pos)
#define    CAN_SR_ESTAT                                           CAN_SR_ESTAT_Msk

#define    CAN_SR_ERRWRN_Pos                                      (6U)
#define    CAN_SR_ERRWRN_Msk                                      (0x1U << CAN_SR_ERRWRN_Pos)
#define    CAN_SR_ERRWRN                                          CAN_SR_ERRWRN_Msk

#define    CAN_SR_BBSY_Pos                                        (5U)
#define    CAN_SR_BBSY_Msk                                        (0x1U << CAN_SR_BBSY_Pos)
#define    CAN_SR_BBSY                                            CAN_SR_BBSY_Msk

#define    CAN_SR_BIDLE_Pos                                       (4U)
#define    CAN_SR_BIDLE_Msk                                       (0x1U << CAN_SR_BIDLE_Pos)
#define    CAN_SR_BIDLE                                           CAN_SR_BIDLE_Msk

#define    CAN_SR_NORMAL_Pos                                      (3U)
#define    CAN_SR_NORMAL_Msk                                      (0x1U << CAN_SR_NORMAL_Pos)
#define    CAN_SR_NORMAL                                          CAN_SR_NORMAL_Msk

#define    CAN_SR_LBACK_Pos                                       (1U)
#define    CAN_SR_LBACK_Msk                                       (0x1U << CAN_SR_LBACK_Pos)
#define    CAN_SR_LBACK                                           CAN_SR_LBACK_Msk

#define    CAN_SR_CONFIG_Pos                                      (0U)
#define    CAN_SR_CONFIG_Msk                                      (0x1U << CAN_SR_CONFIG_Pos)
#define    CAN_SR_CONFIG                                          CAN_SR_CONFIG_Msk

#define    CAN_ISR_BSOFF_Pos                                      (9U)
#define    CAN_ISR_BSOFF_Msk                                      (0x1U << CAN_ISR_BSOFF_Pos)
#define    CAN_ISR_BSOFF                                          CAN_ISR_BSOFF_Msk

#define    CAN_ISR_ERROR_Pos                                      (8U)
#define    CAN_ISR_ERROR_Msk                                      (0x1U << CAN_ISR_ERROR_Pos)
#define    CAN_ISR_ERROR                                          CAN_ISR_ERROR_Msk

#define    CAN_ISR_RXNEMP_Pos                                     (7U)
#define    CAN_ISR_RXNEMP_Msk                                     (0x1U << CAN_ISR_RXNEMP_Pos)
#define    CAN_ISR_RXNEMP                                         CAN_ISR_RXNEMP_Msk

#define    CAN_ISR_RXOFLW_Pos                                     (6U)
#define    CAN_ISR_RXOFLW_Msk                                     (0x1U << CAN_ISR_RXOFLW_Pos)
#define    CAN_ISR_RXOFLW                                         CAN_ISR_RXOFLW_Msk

#define    CAN_ISR_RXUFLW_Pos                                     (5U)
#define    CAN_ISR_RXUFLW_Msk                                     (0x1U << CAN_ISR_RXUFLW_Pos)
#define    CAN_ISR_RXUFLW                                         CAN_ISR_RXUFLW_Msk

#define    CAN_ISR_RXOK_Pos                                       (4U)
#define    CAN_ISR_RXOK_Msk                                       (0x1U << CAN_ISR_RXOK_Pos)
#define    CAN_ISR_RXOK                                           CAN_ISR_RXOK_Msk

#define    CAN_ISR_TXBFLL_Pos                                     (3U)
#define    CAN_ISR_TXBFLL_Msk                                     (0x1U << CAN_ISR_TXBFLL_Pos)
#define    CAN_ISR_TXBFLL                                         CAN_ISR_TXBFLL_Msk

#define    CAN_ISR_TXFLL_Pos                                      (2U)
#define    CAN_ISR_TXFLL_Msk                                      (0x1U << CAN_ISR_TXFLL_Pos)
#define    CAN_ISR_TXFLL                                          CAN_ISR_TXFLL_Msk

#define    CAN_ISR_TXOK_Pos                                       (1U)
#define    CAN_ISR_TXOK_Msk                                       (0x1U << CAN_ISR_TXOK_Pos)
#define    CAN_ISR_TXOK                                           CAN_ISR_TXOK_Msk

#define    CAN_ISR_ARBLST_Pos                                     (0U)
#define    CAN_ISR_ARBLST_Msk                                     (0x1U << CAN_ISR_ARBLST_Pos)
#define    CAN_ISR_ARBLST                                         CAN_ISR_ARBLST_Msk

#define    CAN_IER_BSOFFIE_Pos                                    (9U)
#define    CAN_IER_BSOFFIE_Msk                                    (0x1U << CAN_IER_BSOFFIE_Pos)
#define    CAN_IER_BSOFFIE                                        CAN_IER_BSOFFIE_Msk

#define    CAN_IER_ERRORIE_Pos                                    (8U)
#define    CAN_IER_ERRORIE_Msk                                    (0x1U << CAN_IER_ERRORIE_Pos)
#define    CAN_IER_ERRORIE                                        CAN_IER_ERRORIE_Msk

#define    CAN_IER_RXNEMPIE_Pos                                   (7U)
#define    CAN_IER_RXNEMPIE_Msk                                   (0x1U << CAN_IER_RXNEMPIE_Pos)
#define    CAN_IER_RXNEMPIE                                       CAN_IER_RXNEMPIE_Msk

#define    CAN_IER_RXOFLWIE_Pos                                   (6U)
#define    CAN_IER_RXOFLWIE_Msk                                   (0x1U << CAN_IER_RXOFLWIE_Pos)
#define    CAN_IER_RXOFLWIE                                       CAN_IER_RXOFLWIE_Msk

#define    CAN_IER_RXUFLWIE_Pos                                   (5U)
#define    CAN_IER_RXUFLWIE_Msk                                   (0x1U << CAN_IER_RXUFLWIE_Pos)
#define    CAN_IER_RXUFLWIE                                       CAN_IER_RXUFLWIE_Msk

#define    CAN_IER_RXOKIE_Pos                                     (4U)
#define    CAN_IER_RXOKIE_Msk                                     (0x1U << CAN_IER_RXOKIE_Pos)
#define    CAN_IER_RXOKIE                                         CAN_IER_RXOKIE_Msk

#define    CAN_IER_TXBFLLIE_Pos                                   (3U)
#define    CAN_IER_TXBFLLIE_Msk                                   (0x1U << CAN_IER_TXBFLLIE_Pos)
#define    CAN_IER_TXBFLLIE                                       CAN_IER_TXBFLLIE_Msk

