RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_can.h
#define    CAN_IER_TXFLLIE_Pos                                    (2U)
#define    CAN_IER_TXFLLIE_Msk                                    (0x1U << CAN_IER_TXFLLIE_Pos)
#define    CAN_IER_TXFLLIE                                        CAN_IER_TXFLLIE_Msk

#define    CAN_IER_TXOKIE_Pos                                     (1U)
#define    CAN_IER_TXOKIE_Msk                                     (0x1U << CAN_IER_TXOKIE_Pos)
#define    CAN_IER_TXOKIE                                         CAN_IER_TXOKIE_Msk

#define    CAN_IER_ARBLSTIE_Pos                                   (0U)
#define    CAN_IER_ARBLSTIE_Msk                                   (0x1U << CAN_IER_ARBLSTIE_Pos)
#define    CAN_IER_ARBLSTIE                                       CAN_IER_ARBLSTIE_Msk

#define    CAN_ICR_CBSOFF_Pos                                     (9U)
#define    CAN_ICR_CBSOFF_Msk                                     (0x1U << CAN_ICR_CBSOFF_Pos)
#define    CAN_ICR_CBSOFF                                         CAN_ICR_CBSOFF_Msk

#define    CAN_ICR_CERROR_Pos                                     (8U)
#define    CAN_ICR_CERROR_Msk                                     (0x1U << CAN_ICR_CERROR_Pos)
#define    CAN_ICR_CERROR                                         CAN_ICR_CERROR_Msk

#define    CAN_ICR_CRXNEMP_Pos                                    (7U)
#define    CAN_ICR_CRXNEMP_Msk                                    (0x1U << CAN_ICR_CRXNEMP_Pos)
#define    CAN_ICR_CRXNEMP                                        CAN_ICR_CRXNEMP_Msk

#define    CAN_ICR_CRXOFLW_Pos                                    (6U)
#define    CAN_ICR_CRXOFLW_Msk                                    (0x1U << CAN_ICR_CRXOFLW_Pos)
#define    CAN_ICR_CRXOFLW                                        CAN_ICR_CRXOFLW_Msk

#define    CAN_ICR_CRXUFLW_Pos                                    (5U)
#define    CAN_ICR_CRXUFLW_Msk                                    (0x1U << CAN_ICR_CRXUFLW_Pos)
#define    CAN_ICR_CRXUFLW                                        CAN_ICR_CRXUFLW_Msk

#define    CAN_ICR_CRXOK_Pos                                      (4U)
#define    CAN_ICR_CRXOK_Msk                                      (0x1U << CAN_ICR_CRXOK_Pos)
#define    CAN_ICR_CRXOK                                          CAN_ICR_CRXOK_Msk

#define    CAN_ICR_CTXBFLL_Pos                                    (3U)
#define    CAN_ICR_CTXBFLL_Msk                                    (0x1U << CAN_ICR_CTXBFLL_Pos)
#define    CAN_ICR_CTXBFLL                                        CAN_ICR_CTXBFLL_Msk

#define    CAN_ICR_CTXFLL_Pos                                     (2U)
#define    CAN_ICR_CTXFLL_Msk                                     (0x1U << CAN_ICR_CTXFLL_Pos)
#define    CAN_ICR_CTXFLL                                         CAN_ICR_CTXFLL_Msk

#define    CAN_ICR_CTXOK_Pos                                      (1U)
#define    CAN_ICR_CTXOK_Msk                                      (0x1U << CAN_ICR_CTXOK_Pos)
#define    CAN_ICR_CTXOK                                          CAN_ICR_CTXOK_Msk

#define    CAN_ICR_CARBLST_Pos                                    (0U)
#define    CAN_ICR_CARBLST_Msk                                    (0x1U << CAN_ICR_CARBLST_Pos)
#define    CAN_ICR_CARBLST                                        CAN_ICR_CARBLST_Msk

#define    CAN_TXFIDR_IDR_Pos                                     (0U)
#define    CAN_TXFIDR_IDR_Msk                                     (0xffffffffU << CAN_TXFIDR_IDR_Pos)
#define    CAN_TXFIDR_IDR                                         CAN_TXFIDR_IDR_Msk

#define    CAN_TXFDLCR_DLC_Pos                                    (0U)
#define    CAN_TXFDLCR_DLC_Msk                                    (0xfU << CAN_TXFDLCR_DLC_Pos)
#define    CAN_TXFDLCR_DLC                                        CAN_TXFDLCR_DLC_Msk

#define    CAN_TXFDW1R_DB_Pos                                     (0U)
#define    CAN_TXFDW1R_DB_Msk                                     (0xffffffffU << CAN_TXFDW1R_DB_Pos)
#define    CAN_TXFDW1R_DB                                         CAN_TXFDW1R_DB_Msk

#define    CAN_TXFDW2R_DB_Pos                                     (0U)
#define    CAN_TXFDW2R_DB_Msk                                     (0xffffffffU << CAN_TXFDW2R_DB_Pos)
#define    CAN_TXFDW2R_DB                                         CAN_TXFDW2R_DB_Msk

#define    CAN_HPBIDR_IDR_Pos                                     (0U)
#define    CAN_HPBIDR_IDR_Msk                                     (0xffffffffU << CAN_HPBIDR_IDR_Pos)
#define    CAN_HPBIDR_IDR                                         CAN_HPBIDR_IDR_Msk

#define    CAN_HPBDLCR_DLC_Pos                                    (0U)
#define    CAN_HPBDLCR_DLC_Msk                                    (0xfU << CAN_HPBDLCR_DLC_Pos)
#define    CAN_HPBDLCR_DLC                                        CAN_HPBDLCR_DLC_Msk

#define    CAN_HPBDW1R_DB_Pos                                     (0U)
#define    CAN_HPBDW1R_DB_Msk                                     (0xffffffffU << CAN_HPBDW1R_DB_Pos)
#define    CAN_HPBDW1R_DB                                         CAN_HPBDW1R_DB_Msk

#define    CAN_HPBDW2R_DB_Pos                                     (0U)
#define    CAN_HPBDW2R_DB_Msk                                     (0xffffffffU << CAN_HPBDW2R_DB_Pos)
#define    CAN_HPBDW2R_DB                                         CAN_HPBDW2R_DB_Msk

#define    CAN_RXFIDR_IDR_Pos                                     (0U)
#define    CAN_RXFIDR_IDR_Msk                                     (0xffffffffU << CAN_RXFIDR_IDR_Pos)
#define    CAN_RXFIDR_IDR                                         CAN_RXFIDR_IDR_Msk

#define    CAN_RXFDLCR_DLC_Pos                                    (0U)
#define    CAN_RXFDLCR_DLC_Msk                                    (0xfU << CAN_RXFDLCR_DLC_Pos)
#define    CAN_RXFDLCR_DLC                                        CAN_RXFDLCR_DLC_Msk

#define    CAN_RXFDW1R_DB_Pos                                     (0U)
#define    CAN_RXFDW1R_DB_Msk                                     (0xffffffffU << CAN_RXFDW1R_DB_Pos)
#define    CAN_RXFDW1R_DB                                         CAN_RXFDW1R_DB_Msk

#define    CAN_RXFDW2R_DB_Pos                                     (0U)
#define    CAN_RXFDW2R_DB_Msk                                     (0xffffffffU << CAN_RXFDW2R_DB_Pos)
#define    CAN_RXFDW2R_DB                                         CAN_RXFDW2R_DB_Msk

#define    CAN_AFR_UAF_Pos                                        (0U)
#define    CAN_AFR_UAF_Msk                                        (0xfU << CAN_AFR_UAF_Pos)
#define    CAN_AFR_UAF                                            CAN_AFR_UAF_Msk

#define    CAN_AFMR_AMRTR_Pos                                     (31U)
#define    CAN_AFMR_AMRTR_Msk                                     (0x1U << CAN_AFMR_AMRTR_Pos)
#define    CAN_AFMR_AMRTR                                         CAN_AFMR_AMRTR_Msk

#define    CAN_AFMR_AMID18_Pos                                    (13U)
#define    CAN_AFMR_AMID18_Msk                                    (0x3ffffU << CAN_AFMR_AMID18_Pos)
#define    CAN_AFMR_AMID18                                        CAN_AFMR_AMID18_Msk

#define    CAN_AFMR_AMIDE_Pos                                     (12U)
#define    CAN_AFMR_AMIDE_Msk                                     (0x1U << CAN_AFMR_AMIDE_Pos)
#define    CAN_AFMR_AMIDE                                         CAN_AFMR_AMIDE_Msk

#define    CAN_AFMR_AMSRR_Pos                                     (11U)
#define    CAN_AFMR_AMSRR_Msk                                     (0x1U << CAN_AFMR_AMSRR_Pos)
#define    CAN_AFMR_AMSRR                                         CAN_AFMR_AMSRR_Msk

#define    CAN_AFMR_AMID11_Pos                                    (0U)
#define    CAN_AFMR_AMID11_Msk                                    (0x7ffU << CAN_AFMR_AMID11_Pos)
#define    CAN_AFMR_AMID11                                        CAN_AFMR_AMID11_Msk

#define    CAN_AFIR_AIRTR_Pos                                     (31U)
#define    CAN_AFIR_AIRTR_Msk                                     (0x1U << CAN_AFIR_AIRTR_Pos)
#define    CAN_AFIR_AIRTR                                         CAN_AFIR_AIRTR_Msk

#define    CAN_AFIR_AIID18_Pos                                    (13U)
#define    CAN_AFIR_AIID18_Msk                                    (0x3ffffU << CAN_AFIR_AIID18_Pos)
#define    CAN_AFIR_AIID18                                        CAN_AFIR_AIID18_Msk

#define    CAN_AFIR_AIIDE_Pos                                     (12U)
#define    CAN_AFIR_AIIDE_Msk                                     (0x1U << CAN_AFIR_AIIDE_Pos)
#define    CAN_AFIR_AIIDE                                         CAN_AFIR_AIIDE_Msk

#define    CAN_AFIR_AISRR_Pos                                     (11U)
#define    CAN_AFIR_AISRR_Msk                                     (0x1U << CAN_AFIR_AISRR_Pos)
#define    CAN_AFIR_AISRR                                         CAN_AFIR_AISRR_Msk

#define    CAN_AFIR_AIID11_Pos                                    (0U)
#define    CAN_AFIR_AIID11_Msk                                    (0x7ffU << CAN_AFIR_AIID11_Pos)
#define    CAN_AFIR_AIID11                                        CAN_AFIR_AIID11_Msk



#define    FL_CAN_ERROR_STATUS_CONFIG                              (0x0U << CAN_SR_ESTAT_Pos)
#define    FL_CAN_ERROR_STATUS_ACTIVE                              (0x1U << CAN_SR_ESTAT_Pos)
#define    FL_CAN_ERROR_STATUS_BUSOFF                              (0x2U << CAN_SR_ESTAT_Pos)
#define    FL_CAN_ERROR_STATUS_PASSIVE                             (0x3U << CAN_SR_ESTAT_Pos)


#define    FL_CAN_RTR_BIT_LOW                                      (0x0U << CAN_AFIR_AIRTR_Pos)
#define    FL_CAN_RTR_BIT_HIGH                                     (0x1U << CAN_AFIR_AIRTR_Pos)


#define    FL_CAN_IDE_BIT_LOW                                      (0x0U << CAN_AFIR_AIIDE_Pos)
#define    FL_CAN_IDE_BIT_HIGH                                     (0x1U << CAN_AFIR_AIIDE_Pos)

#define    FL_CAN_SRR_BIT_LOW                                      (0x0U << CAN_AFIR_AISRR_Pos)
#define    FL_CAN_SRR_BIT_HIGH                                     (0x1U << CAN_AFIR_AISRR_Pos)


#define    FL_CAN_SOFTWARE_NO_RESET                                 (0x0U << CAN_CR_SRST_Pos)
#define    FL_CAN_SOFTWARE_RESET                                    (0x1U << CAN_CR_SRST_Pos)



