RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_can.h
#define    FL_CAN_TS1_1Tq                                         (0U)
#define    FL_CAN_TS1_2Tq                                         (1U)
#define    FL_CAN_TS1_3Tq                                         (2U)
#define    FL_CAN_TS1_4Tq                                         (3U)
#define    FL_CAN_TS1_5Tq                                         (4U)
#define    FL_CAN_TS1_6Tq                                         (5U)
#define    FL_CAN_TS1_7Tq                                         (6U)
#define    FL_CAN_TS1_8Tq                                         (7U)
#define    FL_CAN_TS1_9Tq                                         (8U)
#define    FL_CAN_TS1_10Tq                                        (9U)
#define    FL_CAN_TS1_11Tq                                        (10U)
#define    FL_CAN_TS1_12Tq                                        (11U)
#define    FL_CAN_TS1_13Tq                                        (12U)
#define    FL_CAN_TS1_14Tq                                        (13U)
#define    FL_CAN_TS1_15Tq                                        (14U)
#define    FL_CAN_TS1_16Tq                                        (15U)

#define    FL_CAN_TS2_1Tq                                         (0U)
#define    FL_CAN_TS2_2Tq                                         (1U)
#define    FL_CAN_TS2_3Tq                                         (2U)
#define    FL_CAN_TS2_4Tq                                         (3U)
#define    FL_CAN_TS2_5Tq                                         (4U)
#define    FL_CAN_TS2_6Tq                                         (5U)
#define    FL_CAN_TS2_7Tq                                         (6U)
#define    FL_CAN_TS2_8Tq                                         (7U)


#define    FL_CAN_SJW_1Tq                                         (0U)
#define    FL_CAN_SJW_2Tq                                         (1U)
#define    FL_CAN_SJW_3Tq                                         (2U)
#define    FL_CAN_SJW_4Tq                                         (3U)

#define    FL_CAN_MODE_NORMAL                                     (0U)
#define    FL_CAN_MODE_LOOPBACK                                   (1U)
#define    FL_CAN_MODE_CONFIG                                     (2U)

#define    FL_CAN_FIL1_EN                                         (1U << 0U)
#define    FL_CAN_FIL2_EN                                         (1U << 1U)
#define    FL_CAN_FIL3_EN                                         (1U << 2U)
#define    FL_CAN_FIL4_EN                                         (1U << 3U)

#define    FL_CAN_FIL1_MSK                                        (1U << 0U)
#define    FL_CAN_FIL2_MSK                                        (1U << 1U)
#define    FL_CAN_FIL3_MSK                                        (1U << 2U)
#define    FL_CAN_FIL4_MSK                                        (1U << 3U)


#define    FL_CAN_FILTER1                                         (0x0U << 0U)
#define    FL_CAN_FILTER2                                         (0x1U << 0U)
#define    FL_CAN_FILTER3                                         (0x2U << 0U)
#define    FL_CAN_FILTER4                                         (0x3U << 0U)



#define    FL_CAN_FORMAT_STANDARD_DATA                            (0U)
#define    FL_CAN_FORMAT_STANDARD_REMOTE                          (1U)
#define    FL_CAN_FORMAT_EXTEND_DATA                              (2U)
#define    FL_CAN_FORMAT_EXTEND_REMOTE                            (3U)


#define CAN_TIMEOUT      0xFFFFFU

/**
  * @}
  */
/* Exported functions ---------------------------------------------------------------------------------*/
/** @defgroup CAN_FL_Exported_Functions CAN Exported Functions
  * @{
  */

/**
  * @brief    CAN enable
  * @rmtoll   CR    CEN    FL_CAN_Enable
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Enable(CAN_Type *CANx)
{
    SET_BIT(CANx->CR, CAN_CR_CEN_Msk);
}

/**
  * @brief    Get CAN enable status
  * @rmtoll   CR    CEN    FL_CAN_IsEnabled
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabled(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->CR, CAN_CR_CEN_Msk) == CAN_CR_CEN_Msk);
}

/**
  * @brief    CAN disable
  * @rmtoll   CR    CEN    FL_CAN_Disable
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Disable(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->CR, CAN_CR_CEN_Msk);
}

/**
  * @brief    Set CAN software reset
  * @rmtoll   CR    SRST    FL_CAN_SetSoftwareReset
  * @param    CANx CAN instance
  * @param    reset This parameter can be one of the following values:
  *           @arg @ref FL_CAN_SOFTWARE_NO_RESET
  *           @arg @ref FL_CAN_SOFTWARE_RESET
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_SetSoftwareReset(CAN_Type *CANx, uint32_t reset)
{
    MODIFY_REG(CANx->CR, CAN_CR_SRST_Msk, reset);
}

/**
  * @brief    Get CAN software reset
  * @rmtoll   CR    SRST    FL_CAN_GetSoftwareReset
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_SOFTWARE_NO_RESET
  *           @arg @ref FL_CAN_SOFTWARE_RESET
  */
__STATIC_INLINE uint32_t FL_CAN_GetSoftwareReset(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->CR, CAN_CR_SRST_Msk));
}

/**
  * @brief    Enable loop back mode
  * @rmtoll   MSR    LPBACK    FL_CAN_EnableLoopBackMode
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableLoopBackMode(CAN_Type *CANx)
{
    SET_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk);
}
/**
  * @brief    CAN disable
  * @rmtoll   CR    CEN    FL_CAN_Disable
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableLoopBackMode(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk);
}
/**
  * @brief    Get loop back mode Enable Status
  * @rmtoll   MSR    LPBACK    FL_CAN_IsEnabledLoopBackMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledLoopBackMode(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->MSR, CAN_MSR_LPBACK_Msk) == CAN_MSR_LPBACK_Msk);
}

/**
  * @brief    Set baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_CAN_WriteBaudRatePrescaler
  * @param    CANx CAN instance
  * @param    psc
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteBaudRatePrescaler(CAN_Type *CANx, uint32_t psc)
{
    MODIFY_REG(CANx->BRPR, CAN_BRPR_BRP_Msk, (psc << CAN_BRPR_BRP_Pos));
}

/**
  * @brief    Get baud rate prescaler
  * @rmtoll   BRPR    BRP    FL_CAN_ReadBaudRatePrescaler
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadBaudRatePrescaler(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->BRPR, CAN_BRPR_BRP_Msk) >> CAN_BRPR_BRP_Pos);
}

/**
  * @brief    Set synchronization jump width
  * @rmtoll   BTR    SJW    FL_CAN_WriteSyncJumpWidth
  * @param    CANx CAN instance
  * @param    width
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteSyncJumpWidth(CAN_Type *CANx, uint32_t width)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_SJW_Msk, (width << CAN_BTR_SJW_Pos));
}

/**
  * @brief    Get synchronization jump width
  * @rmtoll   BTR    SJW    FL_CAN_ReadSyncJumpWidth
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadSyncJumpWidth(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_SJW_Msk) >> CAN_BTR_SJW_Pos);
}

/**
  * @brief    Set time segment2 length
  * @rmtoll   BTR    TS2    FL_CAN_WriteTimeSegment2Length
  * @param    CANx CAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTimeSegment2Length(CAN_Type *CANx, uint32_t length)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_TS2_Msk, (length << CAN_BTR_TS2_Pos));
}

/**
  * @brief    Get time segment2 length
  * @rmtoll   BTR    TS2    FL_CAN_ReadTimeSegment2Length
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTimeSegment2Length(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_TS2_Msk) >> CAN_BTR_TS2_Pos);
}

/**
  * @brief    Set time segment2 length
  * @rmtoll   BTR    TS1    FL_CAN_WriteTimeSegment1Length
  * @param    CANx CAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTimeSegment1Length(CAN_Type *CANx, uint32_t length)
{
    MODIFY_REG(CANx->BTR, CAN_BTR_TS1_Msk, (length << CAN_BTR_TS1_Pos));
}

/**
  * @brief    Get time segment2 length
  * @rmtoll   BTR    TS1    FL_CAN_ReadTimeSegment1Length
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTimeSegment1Length(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->BTR, CAN_BTR_TS1_Msk) >> CAN_BTR_TS1_Pos);
}

/**
  * @brief    Get receive error number
  * @rmtoll   ECR    REC    FL_CAN_ReadRXErrorCount
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXErrorCount(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ECR, CAN_ECR_REC_Msk) >> CAN_ECR_REC_Pos);
}

/**
  * @brief    Get transmit error number
  * @rmtoll   ECR    TEC    FL_CAN_ReadTXErrorCount
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXErrorCount(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ECR, CAN_ECR_TEC_Msk) >> CAN_ECR_TEC_Pos);
}

/**
  * @brief    Get ACK error flag
  * @rmtoll   ESR    ACKER    FL_CAN_IsActiveFlag_AckError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_AckError(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_ACKER_Msk) == (CAN_ESR_ACKER_Msk));
}

/**
  * @brief    Clear ACK error flag
  * @rmtoll   ESR    ACKER    FL_CAN_ClearFlag_AckError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_AckError(CAN_Type *CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_ACKER_Msk);
}

/**
  * @brief    Get receive bit error flag
  * @rmtoll   ESR    BERR    FL_CAN_IsActiveFlag_BitError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BitError(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_BERR_Msk) == (CAN_ESR_BERR_Msk));
}

/**
  * @brief    Clear receive bit error flag
  * @rmtoll   ESR    BERR    FL_CAN_ClearFlag_BitError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_BitError(CAN_Type *CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_BERR_Msk);
}

/**
  * @brief    Get stuffing error flag
  * @rmtoll   ESR    STER    FL_CAN_IsActiveFlag_StuffError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_StuffError(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_STER_Msk) == (CAN_ESR_STER_Msk));
}

/**
  * @brief    Clear stuffing error flag
  * @rmtoll   ESR    STER    FL_CAN_ClearFlag_StuffError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_StuffError(CAN_Type *CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_STER_Msk);
}

/**
  * @brief    Get form error flag
  * @rmtoll   ESR    FMER    FL_CAN_IsActiveFlag_FormatError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_FormatError(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_FMER_Msk) == (CAN_ESR_FMER_Msk));
}

/**
  * @brief    Clear form error flag
  * @rmtoll   ESR    FMER    FL_CAN_ClearFlag_FormatError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_FormatError(CAN_Type *CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_FMER_Msk);
}

/**
  * @brief    Get CRC error fiag
  * @rmtoll   ESR    CRCER    FL_CAN_IsActiveFlag_CRCError
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_CRCError(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ESR, CAN_ESR_CRCER_Msk) == (CAN_ESR_CRCER_Msk));
}

/**
  * @brief    Clear CRC error flag
  * @rmtoll   ESR    CRCER    FL_CAN_ClearFlag_CRCError
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_CRCError(CAN_Type *CANx)
{
    WRITE_REG(CANx->ESR, CAN_ESR_CRCER_Msk);
}

/**
  * @brief    Get acceptance filter busy flag
  * @rmtoll   SR    ACFBSY    FL_CAN_IsActiveFlag_FilterBusy
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_FilterBusy(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_ACFBSY_Msk) == (CAN_SR_ACFBSY_Msk));
}

/**
  * @brief    Get transmit FIFO FULL interrupt flag
  * @rmtoll   SR    TXFLL    FL_CAN_IsActiveFlag_TXBuffFullSignal
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXBuffFullSignal(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_TXFLL_Msk) == (CAN_SR_TXFLL_Msk));
}

/**
  * @brief    Get high priority transmit buffer FULL interrupt flag
  * @rmtoll   SR    TXBFLL    FL_CAN_IsActiveFlag_TXHighPriorBuffFullSignal
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXHighPriorBuffFullSignal(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_TXBFLL_Msk) == (CAN_SR_TXBFLL_Msk));
}

/**
  * @brief    Get error status flag
  * @rmtoll   SR    ESTAT    FL_CAN_GetErrorStatus
  * @param    CANx CAN instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_CAN_ERROR_STATUS_CONFIG
  *           @arg @ref FL_CAN_ERROR_STATUS_ACTIVE
  *           @arg @ref FL_CAN_ERROR_STATUS_BUSOFF
  *           @arg @ref FL_CAN_ERROR_STATUS_PASSIVE
  */
__STATIC_INLINE uint32_t FL_CAN_GetErrorStatus(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_ESTAT_Msk));
}

/**
  * @brief    Get error warning
  * @rmtoll   SR    ERRWRN    FL_CAN_IsActiveFlag_ErrorWarning
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ErrorWarning(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_ERRWRN_Msk) == (CAN_SR_ERRWRN_Msk));
}

/**
  * @brief    Get bus busy flag
  * @rmtoll   SR    BBSY    FL_CAN_IsActiveFlag_BusBusy
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusBusy(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_BBSY_Msk) == (CAN_SR_BBSY_Msk));
}

/**
  * @brief    Get bus IDLE flag
  * @rmtoll   SR    BIDLE    FL_CAN_IsActiveFlag_BusIdle
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusIdle(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_BIDLE_Msk) == (CAN_SR_BIDLE_Msk));
}

/**
  * @brief    Get normal mode flag
  * @rmtoll   SR    NORMAL    FL_CAN_IsActiveFlag_NormalMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_NormalMode(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_NORMAL_Msk) == (CAN_SR_NORMAL_Msk));
}

/**
  * @brief    Get loop back mode flag
  * @rmtoll   SR    LBACK    FL_CAN_IsActiveFlag_LoopbackMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_LoopbackMode(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_LBACK_Msk) == (CAN_SR_LBACK_Msk));
}

/**
  * @brief    Get configuration mode flag
  * @rmtoll   SR    CONFIG    FL_CAN_IsActiveFlag_ConfigMode
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ConfigMode(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->SR, CAN_SR_CONFIG_Msk) == (CAN_SR_CONFIG_Msk));
}

/**
  * @brief    Get bus off interrupt flag
  * @rmtoll   ISR    BSOFF    FL_CAN_IsActiveFlag_BusOff
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_BusOff(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_BSOFF_Msk) == (CAN_ISR_BSOFF_Msk));
}

/**
  * @brief    Get error interrupt  flag
  * @rmtoll   ISR    ERROR    FL_CAN_IsActiveFlag_Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_Error(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_ERROR_Msk) == (CAN_ISR_ERROR_Msk));
}

/**
  * @brief    Get receive FIFO not empty interrupt flag
  * @rmtoll   ISR    RXNEMP    FL_CAN_IsActiveFlag_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXNotEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_RXNEMP_Msk) == (CAN_ISR_RXNEMP_Msk));
}

/**
  * @brief    Get receive FIFO overflow interrupt flag
  * @rmtoll   ISR    RXOFLW    FL_CAN_IsActiveFlag_RXOverflow
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXOverflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_RXOFLW_Msk) == (CAN_ISR_RXOFLW_Msk));
}

/**
  * @brief    Get receive FIFO empty interrupt flag
  * @rmtoll   ISR    RXUFLW    FL_CAN_IsActiveFlag_RXEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_RXUFLW_Msk) == (CAN_ISR_RXUFLW_Msk));
}

/**
  * @brief    Get receive Ok interrupt flag
  * @rmtoll   ISR    RXOK    FL_CAN_IsActiveFlag_RXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_RXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_RXOK_Msk) == (CAN_ISR_RXOK_Msk));
}

/**
  * @brief    Get high priority transmit buffer FULL interrupt flag
  * @rmtoll   ISR    TXBFLL    FL_CAN_IsActiveFlag_TXHighPriorBuffFull
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXHighPriorBuffFull(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_TXBFLL_Msk) == (CAN_ISR_TXBFLL_Msk));
}

/**
  * @brief    Get transmit FIFO FULL interrupt flag
  * @rmtoll   ISR    TXFLL    FL_CAN_IsActiveFlag_TXBuffFull
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXBuffFull(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_TXFLL_Msk) == (CAN_ISR_TXFLL_Msk));
}

/**
  * @brief    Get transmission OK interrupt flag
  * @rmtoll   ISR    TXOK    FL_CAN_IsActiveFlag_TXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_TXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_TXOK_Msk) == (CAN_ISR_TXOK_Msk));
}

/**
  * @brief    Get arbitration lost interrupt flag
  * @rmtoll   ISR    ARBLST    FL_CAN_IsActiveFlag_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsActiveFlag_ArbitrationLost(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->ISR, CAN_ISR_ARBLST_Msk) == (CAN_ISR_ARBLST_Msk));
}

/**
  * @brief    Bus OFF interrupt enable
  * @rmtoll   IER    BSOFFIE    FL_CAN_EnableIT_BusOff
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_BusOff(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_BSOFFIE_Msk);
}

/**
  * @brief    Get bus OFF interrupt enable status
  * @rmtoll   IER    BSOFFIE    FL_CAN_IsEnabledIT_BusOff
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_BusOff(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_BSOFFIE_Msk) == CAN_IER_BSOFFIE_Msk);
}

/**
  * @brief    Bus OFF interrupt disable
  * @rmtoll   IER    BSOFFIE    FL_CAN_DisableIT_BusOff
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_BusOff(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_BSOFFIE_Msk);
}

/**
  * @brief    Error interrupt enable
  * @rmtoll   IER    ERRORIE    FL_CAN_EnableIT_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_Error(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_ERRORIE_Msk);
}

/**
  * @brief    Get error interrupt enable status
  * @rmtoll   IER    ERRORIE    FL_CAN_IsEnabledIT_Error
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_Error(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_ERRORIE_Msk) == CAN_IER_ERRORIE_Msk);
}

/**
  * @brief    Error interrupt disable
  * @rmtoll   IER    ERRORIE    FL_CAN_DisableIT_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_Error(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_ERRORIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt enable
  * @rmtoll   IER    RXNEMPIE    FL_CAN_EnableIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXNotEmpty(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Get receive FIFO not empty interrupt enable status
  * @rmtoll   IER    RXNEMPIE    FL_CAN_IsEnabledIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXNotEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_RXNEMPIE_Msk) == CAN_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO not empty interrupt disable
  * @rmtoll   IER    RXNEMPIE    FL_CAN_DisableIT_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXNotEmpty(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_RXNEMPIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt ennable
  * @rmtoll   IER    RXOFLWIE    FL_CAN_EnableIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXOverflow(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO overflow interrupt enable status
  * @rmtoll   IER    RXOFLWIE    FL_CAN_IsEnabledIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXOverflow(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_RXOFLWIE_Msk) == CAN_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO overflow interrupt disable
  * @rmtoll   IER    RXOFLWIE    FL_CAN_DisableIT_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXOverflow(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_RXOFLWIE_Msk);
}

/**
  * @brief    Receive FIFO empty interrupt enable
  * @rmtoll   IER    RXUFLWIE    FL_CAN_EnableIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXEmpty(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_RXUFLWIE_Msk);
}

/**
  * @brief    Get receive FIFO empty interrupt enable status
  * @rmtoll   IER    RXUFLWIE    FL_CAN_IsEnabledIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXEmpty(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_RXUFLWIE_Msk) == CAN_IER_RXUFLWIE_Msk);
}

