RT-Thread/rt-thread/bsp/fm33lg026/libraries/FM33LG0xx_FL_Driver/Inc/fm33lg0xx_fl_can.h
/**
  * @brief    Receive FIFO empty interrupt disable
  * @rmtoll   IER    RXUFLWIE    FL_CAN_DisableIT_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXEmpty(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_RXUFLWIE_Msk);
}

/**
  * @brief    Receive OK interrupt enable
  * @rmtoll   IER    RXOKIE    FL_CAN_EnableIT_RXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_RXOK(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_RXOKIE_Msk);
}

/**
  * @brief    Get receive OK interrupt enable
  * @rmtoll   IER    RXOKIE    FL_CAN_IsEnabledIT_RXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_RXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_RXOKIE_Msk) == CAN_IER_RXOKIE_Msk);
}

/**
  * @brief    Receive OK interrupt disable
  * @rmtoll   IER    RXOKIE    FL_CAN_DisableIT_RXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_RXOK(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_RXOKIE_Msk);
}

/**
  * @brief    High priority transmit buffer FULL interrupt enable
  * @rmtoll   IER    TXBFLLIE    FL_CAN_EnableIT_TXHighPriorBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_TXHighPriorBuffFull(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_TXBFLLIE_Msk);
}

/**
  * @brief    Get high priority transmit buffer FULL interrupt enable status
  * @rmtoll   IER    TXBFLLIE    FL_CAN_IsEnabledIT_TXHighPriorBuffFull
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_TXHighPriorBuffFull(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_TXBFLLIE_Msk) == CAN_IER_TXBFLLIE_Msk);
}

/**
  * @brief    High priority transmit buffer FULL interrupt disable
  * @rmtoll   IER    TXBFLLIE    FL_CAN_DisableIT_TXHighPriorBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_TXHighPriorBuffFull(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_TXBFLLIE_Msk);
}

/**
  * @brief    Transmit FIFO FULL interrupt enable
  * @rmtoll   IER    TXFLLIE    FL_CAN_EnableIT_TXBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_TXBuffFull(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_TXFLLIE_Msk);
}

/**
  * @brief    Get transmit FIFO FULL interrupt enable
  * @rmtoll   IER    TXFLLIE    FL_CAN_IsEnabledIT_TXBuffFull
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_TXBuffFull(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_TXFLLIE_Msk) == CAN_IER_TXFLLIE_Msk);
}

/**
  * @brief    Transmit FIFO FULL interrupt disable
  * @rmtoll   IER    TXFLLIE    FL_CAN_DisableIT_TXBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_TXBuffFull(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_TXFLLIE_Msk);
}

/**
  * @brief    Transmission OK interrupt enable
  * @rmtoll   IER    TXOKIE    FL_CAN_EnableIT_TXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_TXOK(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_TXOKIE_Msk);
}

/**
  * @brief    Get transmission OK interrupt enable status
  * @rmtoll   IER    TXOKIE    FL_CAN_IsEnabledIT_TXOK
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_TXOK(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_TXOKIE_Msk) == CAN_IER_TXOKIE_Msk);
}

/**
  * @brief    Transmission OK interrupt disable
  * @rmtoll   IER    TXOKIE    FL_CAN_DisableIT_TXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_TXOK(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_TXOKIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt enable
  * @rmtoll   IER    ARBLSTIE    FL_CAN_EnableIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_EnableIT_ArbitrationLost(CAN_Type *CANx)
{
    SET_BIT(CANx->IER, CAN_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Get arbitration lost interrupt enable
  * @rmtoll   IER    ARBLSTIE    FL_CAN_IsEnabledIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_IsEnabledIT_ArbitrationLost(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->IER, CAN_IER_ARBLSTIE_Msk) == CAN_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Arbitration lost interrupt disable
  * @rmtoll   IER    ARBLSTIE    FL_CAN_DisableIT_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_DisableIT_ArbitrationLost(CAN_Type *CANx)
{
    CLEAR_BIT(CANx->IER, CAN_IER_ARBLSTIE_Msk);
}

/**
  * @brief    Clear bus off interrupt flag
  * @rmtoll   ICR    CBSOFF    FL_CAN_ClearFlag_BusOff
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_BusOff(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CBSOFF_Msk);
}

/**
  * @brief    Clear error interrupt flag
  * @rmtoll   ICR    CERROR    FL_CAN_ClearFlag_Error
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_Error(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CERROR_Msk);
}

/**
  * @brief    Clear receive FIFO not empty interrupt flag
  * @rmtoll   ICR    CRXNEMP    FL_CAN_ClearFlag_RXNotEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXNotEmpty(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CRXNEMP_Msk);
}

/**
  * @brief    Clear  receive FIFO overflow interrupt flag
  * @rmtoll   ICR    CRXOFLW    FL_CAN_ClearFlag_RXOverflow
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXOverflow(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CRXOFLW_Msk);
}

/**
  * @brief    Clear receive FIFO underflow interrupt flag
  * @rmtoll   ICR    CRXUFLW    FL_CAN_ClearFlag_RXEmpty
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXEmpty(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CRXUFLW_Msk);
}

/**
  * @brief    Clear receive OK interrupt flag
  * @rmtoll   ICR    CRXOK    FL_CAN_ClearFlag_RXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_RXOK(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CRXOK_Msk);
}

/**
  * @brief    Clear  high priority transmit buffer FULL interrupt flag
  * @rmtoll   ICR    CTXBFLL    FL_CAN_ClearFlag_TXHighPriorBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_TXHighPriorBuffFull(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CTXBFLL_Msk);
}

/**
  * @brief    Clear transmit FIFO FULL interrupt flag
  * @rmtoll   ICR    CTXFLL    FL_CAN_ClearFlag_TXBuffFull
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_TXBuffFull(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CTXFLL_Msk);
}

/**
  * @brief    Clear transmission OK interrupt flag
  * @rmtoll   ICR    CTXOK    FL_CAN_ClearFlag_TXOK
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_TXOK(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CTXOK_Msk);
}

/**
  * @brief    Clear arbitration lost interrupt flag
  * @rmtoll   ICR    CARBLST    FL_CAN_ClearFlag_ArbitrationLost
  * @param    CANx CAN instance
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_ClearFlag_ArbitrationLost(CAN_Type *CANx)
{
    WRITE_REG(CANx->ICR, CAN_ICR_CARBLST_Msk);
}

/**
  * @brief    Set TXFIFO message identifier code
  * @rmtoll   TXFIDR    IDR    FL_CAN_WriteTXMessageID
  * @param    CANx CAN instance
  * @param    id
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageID(CAN_Type *CANx, uint32_t id)
{
    MODIFY_REG(CANx->TXFIDR, (0xffffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get TXFIFO message identifier code
  * @rmtoll   TXFIDR    IDR    FL_CAN_ReadTXMessageID
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageID(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXFIDR, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set TXFIFO data length code
  * @rmtoll   TXFDLCR    DLC    FL_CAN_WriteTXMessageLength
  * @param    CANx CAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageLength(CAN_Type *CANx, uint32_t length)
{
    MODIFY_REG(CANx->TXFDLCR, (0xfU << 0U), (length << 0U));
}

/**
  * @brief    Get TXFIFO data length code
  * @rmtoll   TXFDLCR    DLC    FL_CAN_ReadTXMessageLength
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageLength(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXFDLCR, 0xfU) >> 0U);
}

/**
  * @brief    Set TXFIFO data word1
  * @rmtoll   TXFDW1R    DB    FL_CAN_WriteTXMessageWord1
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageWord1(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->TXFDW1R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get TXFIFO data word1
  * @rmtoll   TXFDW1R    DB    FL_CAN_ReadTXMessageWord1
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageWord1(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXFDW1R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set TXFIFO data word2
  * @rmtoll   TXFDW2R    DB    FL_CAN_WriteTXMessageWord2
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteTXMessageWord2(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->TXFDW2R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get TXFIFO data word2
  * @rmtoll   TXFDW2R    DB    FL_CAN_ReadTXMessageWord2
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadTXMessageWord2(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->TXFDW2R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set HPB identifier code
  * @rmtoll   HPBIDR    IDR    FL_CAN_WriteHighPriorTXMessageID
  * @param    CANx CAN instance
  * @param    id
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteHighPriorTXMessageID(CAN_Type *CANx, uint32_t id)
{
    MODIFY_REG(CANx->HPBIDR, (0xffffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get HPB identifier code
  * @rmtoll   HPBIDR    IDR    FL_CAN_ReadHighPriorTXMessageID
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadHighPriorTXMessageID(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->HPBIDR, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set HPB data length code
  * @rmtoll   HPBDLCR    DLC    FL_CAN_WriteHighPriorMessageLength
  * @param    CANx CAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteHighPriorMessageLength(CAN_Type *CANx, uint32_t length)
{
    MODIFY_REG(CANx->HPBDLCR, (0xfU << 0U), (length << 0U));
}

/**
  * @brief    Get HPB data length code
  * @rmtoll   HPBDLCR    DLC    FL_CAN_ReadHighPriorMessageLength
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadHighPriorMessageLength(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->HPBDLCR, 0xfU) >> 0U);
}

/**
  * @brief    Set HPB data word1
  * @rmtoll   HPBDW1R    DB    FL_CAN_WriteHighPriorMessageWord1
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteHighPriorMessageWord1(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->HPBDW1R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get HPB data word1
  * @rmtoll   HPBDW1R    DB    FL_CAN_ReadHighPriorMessageWord1
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadHighPriorMessageWord1(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->HPBDW1R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set HPB data word2
  * @rmtoll   HPBDW2R    DB    FL_CAN_WriteHighPriorMessageWord2
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteHighPriorMessageWord2(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->HPBDW2R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get HPB data word2
  * @rmtoll   HPBDW2R    DB    FL_CAN_ReadHighPriorMessageWord2
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadHighPriorMessageWord2(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->HPBDW2R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set RXFIFO message identifier code
  * @rmtoll   RXFIDR    IDR    FL_CAN_WriteRXMessageID
  * @param    CANx CAN instance
  * @param    id
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteRXMessageID(CAN_Type *CANx, uint32_t id)
{
    MODIFY_REG(CANx->RXFIDR, (0xffffffffU << 0U), (id << 0U));
}

/**
  * @brief    Get RXFIFO message identifier code
  * @rmtoll   RXFIDR    IDR    FL_CAN_ReadRXMessageID
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXMessageID(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RXFIDR, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set RXFIFO data length code
  * @rmtoll   RXFDLCR    DLC    FL_CAN_WriteRXMessageLength
  * @param    CANx CAN instance
  * @param    length
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteRXMessageLength(CAN_Type *CANx, uint32_t length)
{
    MODIFY_REG(CANx->RXFDLCR, (0xfU << 0U), (length << 0U));
}

/**
  * @brief    Get RXFIFO data length code
  * @rmtoll   RXFDLCR    DLC    FL_CAN_ReadRXMessageLength
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXMessageLength(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RXFDLCR, 0xfU) >> 0U);
}

/**
  * @brief    Set RXFIFO data word1
  * @rmtoll   RXFDW1R    DB    FL_CAN_WriteRXMessageWord1
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteRXMessageWord1(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->RXFDW1R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get RXFIFO data word1
  * @rmtoll   RXFDW1R    DB    FL_CAN_ReadRXMessageWord1
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXMessageWord1(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RXFDW1R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Set RXFIFO data word2
  * @rmtoll   RXFDW2R    DB    FL_CAN_WriteRXMessageWord2
  * @param    CANx CAN instance
  * @param    word
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_WriteRXMessageWord2(CAN_Type *CANx, uint32_t word)
{
    MODIFY_REG(CANx->RXFDW2R, (0xffffffffU << 0U), (word << 0U));
}

/**
  * @brief    Get RXFIFO data word2
  * @rmtoll   RXFDW2R    DB    FL_CAN_ReadRXMessageWord2
  * @param    CANx CAN instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_CAN_ReadRXMessageWord2(CAN_Type *CANx)
{
    return (uint32_t)(READ_BIT(CANx->RXFDW2R, 0xffffffffU) >> 0U);
}

/**
  * @brief    Acceptance filter 4 enable
  * @rmtoll   AFR    UAF    FL_CAN_Filter_Enable
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_Enable(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(CANx->AFR, 0x1U << filterX);
}

/**
  * @brief    Get acceptance filter 4 enable status
  * @rmtoll   AFR    UAF    FL_CAN_Filter_IsEnabled
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_Filter_IsEnabled(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(CANx->AFR, (((0x1U << filterX) & 0xf) << CAN_AFR_UAF_Pos)) == (((0x1U << filterX) & 0xf) << CAN_AFR_UAF_Pos));
}

/**
  * @brief    Acceptance filter 4 disable
  * @rmtoll   AFR    UAF    FL_CAN_Filter_Disable
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_Disable(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(CANx->AFR, (((0x1U << filterX) & 0xf) << CAN_AFR_UAF_Pos));
}

/**
  * @brief    Enable RTR participate filter compare
  * @rmtoll   AFMR    AMRTR    FL_CAN_Filter_EnableRTRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_EnableRTRCompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Disable RTR participate filter compare
  * @rmtoll   AFMR    AMRTR    FL_CAN_Filter_DisableRTRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_CAN_Filter_DisableRTRCompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Get RTR participate filter compare Enable Status
  * @rmtoll   AFMR    AMRTR    FL_CAN_Filter_IsEnabledRTRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_Filter_IsEnabledRTRCompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMRTR_Msk) == CAN_AFMR_AMRTR_Msk);
}

/**
  * @brief    Set ID low 18bit participate filter compare
  * @rmtoll   AFMR    AMID18    FL_CAN_Filter_WriteEXTIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_WriteEXTIDCompareMask(CAN_Type *CANx, uint32_t filterX, uint32_t id18)
{
    MODIFY_REG(*(&(CANx->AFMR0) + 2 * filterX), (0x3ffffU << CAN_AFMR_AMID18_Pos), (id18 << CAN_AFMR_AMID18_Pos));
}

/**
  * @brief    Get ID low 18bit participate filter compare
  * @rmtoll   AFMR    AMID18    FL_CAN_Filter_ReadEXTIDCompareMask
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE uint32_t FL_CAN_Filter_ReadEXTIDCompareMask(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR0) + 2 * filterX), (0x3ffffU << CAN_AFMR_AMID18_Pos)) >> CAN_AFMR_AMID18_Pos);
}

/**
  * @brief    Enable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_Filter_EnableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_EnableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMIDE_Msk);
}

/**
  * @brief    Disable IDE participate filter compare
  * @rmtoll   AFMR    AMIDE    FL_CAN_Filter_DisableIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_CAN_Filter_DisableIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMIDE_Msk);
}

/**
  * @brief    Get IDE participate filter compare Enable Status
  * @rmtoll   AFMR    AMIDE    FL_CAN_Filter_IsEnabledIDECompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_Filter_IsEnabledIDECompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMIDE_Msk) == CAN_AFMR_AMIDE_Msk);
}

/**
  * @brief    Enable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_EnableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   None
  */
__STATIC_INLINE void FL_CAN_Filter_EnableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    SET_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMSRR_Msk);
}

/**
  * @brief    Disable SRR participate filter compare
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_DisableSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   Returned value can be one of the following values:
  */
__STATIC_INLINE void FL_CAN_Filter_DisableSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    CLEAR_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMSRR_Msk);
}

/**
  * @brief    Get SRR participate filter compare Enable Status
  * @rmtoll   AFMR    AMSRR    FL_CAN_Filter_IsEnabledSRRCompare
  * @param    CANx CAN instance
  * @param    filterX This parameter can be one of the following values:
  *           @arg @ref FL_CAN_FILTER1
  *           @arg @ref FL_CAN_FILTER2
  *           @arg @ref FL_CAN_FILTER3
  *           @arg @ref FL_CAN_FILTER4
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_CAN_Filter_IsEnabledSRRCompare(CAN_Type *CANx, uint32_t filterX)
{
    return (uint32_t)(READ_BIT(*(&(CANx->AFMR0) + 2 * filterX), CAN_AFMR_AMSRR_Msk) == CAN_AFMR_AMSRR_Msk);
}

